#ifndef __HW_USART_H
#define __HW_USART_H


/*-------------------------------------------------------------------
1.USART1_IRQHandler()从stm32f10x_it.c中移到该文件中暂存，移植到serial.c中

2.注意调中断优先级！！！！！！！！！！
带移植区：


USART_ITConfig(USART1,USART_IT_TXE, ENABLE);//开启发送中断并立刻进入发送中断，代替掉CSR0B |=  (1 << UDRIE0)



-------------------------------------------------------------------*/

//###################################【API】###################################
void HW_USART_Init(u32 bound);		//串口初始化（bound：波特率）


#endif
