#ifndef DELAY_H
#define DELAY_H

//###############################【系统函数】####################################
void SysTick_Handler(void);

//###############################【API】####################################

void delay_init(u8 SYSCLK);		//初始化延迟函数，SYSCLK:系统时钟,一般写72

void _delay_us(u32 nus);			//延时nus,nus为要延时的us数
void _delay_ms(u16 nms);			//延时nms,nms为要延时的ms数

/*----------------------------------------------------------------------------
			这里可以直接替换掉GRBL中nuts_bolts.c自带的延时
----------------------------------------------------------------------------*/

#endif
